app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC
---
  def index
    @blogs = Blog.all.order(created_at: :desc)

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ? ORDER BY "comments"."created_at" DESC  [["blog_id", 6]]
---
  def show
    @comment = Comment.new

    @comments = @blog.comments.order(created_at: :desc)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."author" = ?  [["author", "parker@starkinc.com"]]
---
  def myposts
    @blog=Blog.where(author: current_user.email)

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?)  [["title", "Test 1"], ["body", "Test post by peter parker"], ["created_at", "2020-09-28 15:35:19.360336"], ["updated_at", "2020-09-28 15:35:19.360336"], ["author", "parker@starkinc.com"]]
---
  def create
    @blog = Blog.new(blog_params)
    @blog.author = current_user.email
    if @blog.save

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 2]]
---
  def destroy
    @blog.destroy

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.find(params[:id])