app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "created_at", "updated_at", "blog_id") VALUES (?, ?, ?, ?)  [["comment", "test comment"], ["created_at", "2020-09-28 14:46:47.956327"], ["updated_at", "2020-09-28 14:46:47.956327"], ["blog_id", 1]]
UPDATE "comments" SET "updated_at" = ?, "user" = ? WHERE "comments"."id" = ?  [["updated_at", "2020-09-28 15:55:36.013789"], ["user", "Tony Stark"], ["id", 1]]
---
    def create
        @blog = Blog.find(params[:blog_id])
        @comment = @blog.comments.create(comment_params)
        @comment.user = current_user.email
        if @comment.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def destroy
        @blog = Blog.find(params[:blog_id])
        @comment = Comment.find(params[:id])
        @comment.destroy